Friends | List of all members
ACAPI::MEP::v1::DuctReferenceSet Class Referencefinal
MEP Element Manager
The DuctReferenceSet contains referenceIds that are used in DuctCircularSegmentPreferenceTable and DuctCircularElbowPreferenceTable. More...
#include <MEPDuctReferenceSet.hpp>
 Inheritance diagram for ACAPI::MEP::v1::DuctReferenceSet:
 Friends
Result< DuctReferenceSet >  | GetDuctReferenceSet ()
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::ReferenceSetBase
bool  | Exists () const
Result< void >  | IsEditable () const
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetReferenceId (uint32_t index) const
Result< bool >  | IsReferenceIdDefined (uint32_t index) const
Checks whether an entry from the referenceSet is defined. A referenceId is defined if at least one preferenceTable has values associated to it.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetName (const GS::UniString &referenceSetName)
Sets the name of the referenceSet.
Result< uint32_t >  | Add (uint32_t id)
Adds a new referenceId into the referenceSet. If the id is a duplicate, it will not be inserted twice.
Result< void >  | Delete (uint32_t id)
Deletes an entry from the referenceSet. Only undefined referenceIds can be deleted. A referenceId is defined if at least one preferenceTable has values associated to it.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::v1::ReferenceSetBase
ReferenceSetBase (std::shared_ptr< Impl::IReferenceSetBaseImpl > impl)
Constructs a ReferenceSetBase with the given base implementation.
Modifier (ReferenceSetBase &parent)
Constructs a Modifier with the given referenceSetBase.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctReferenceSet contains referenceIds that are used in DuctCircularSegmentPreferenceTable and DuctCircularElbowPreferenceTable.
Since
Archicad 28
The container is already initialized and you can access it by calling GetDuctReferenceSet.
Example code snippet from Test / New MEP
Take a look at ReferenceSetBase
Friends And Related Symbol Documentation
◆ GetDuctReferenceSet
 Result< DuctReferenceSet > GetDuctReferenceSet  |  ( |   | )
friend
Returns
If able, returns the DuctReferenceSet from the project.